{
  "2023-05-06": {
    "date": "2023-05-06",
    "summary": "Our first date was around 12 hours long. After we were official she said I talked too much this first date especially since she had use her brain to translate everything to Japanese... We went to the Broad, shared Mexican and Filipino food at Grand Central Market, walked around the outdoor mall and beach near Santa Monica Pier, and finished with some pho!",
    "title": "First Date"
  },
  "2023-05-14": {
    "date": "2023-05-14",
    "summary": "Mari's favorite food is shaved ice, especially Japanese style shaved ice called 'kakigori'! We went to the Hollywood Farmer's Market to eat, and then Smorgasburg to eat more and then Oakobing to eat some Korean style shaved ice.",
    "title": "More Food"
  },
  "2023-06-10": {
    "date": "2023-06-10",
    "summary": "She's always down to order more :D. We got yummy Indian food and Sup Noodle Bar(her original fav US restaurant). After we finished eating she was down to order more <3. A girl that can eat is so damn attractive wow. We also went to the Aquarium of the Pacific and got attacked by birds lol.",
    "title": "Her fav food in the US?"
  },
  "2023-06-17": {
    "date": "2023-06-17",
    "summary": "I asked Mari to be my girlfriend and she said yes! We did the Eaton Canyon hike, AYCE sushi at Aikan Sushi and Ramen, and did 36 questions to fall in love.",
    "title": "We're Official!"
  },
  "2023-06-24": {
    "date": "2023-06-24",
    "summary": "We ate ramen at Menya Ultra, ate kakigori at Koli bar, hiked Torrey Pines State Park, walked around La Jolla, saw her first wedding in the US, ate BBQ at Phil's BBQ(her current favorite restaurant in the US), and ate more at Mngo Cafe.",
    "title": "1st Time San Diego"
  },
  "2023-07-07": {
    "date": "2023-07-07",
    "summary": "First double date with my buddy Josh and his future wifee Emily! In Japan, you don't usually hang out with friends of your significant other until you're both married :O. AYCE sushi is always welcome XD.",
    "title": "First Double Date"
  },
  "2023-08-04": {
    "date": "2023-08-04",
    "summary": "August 4 to August 11. Mari said she was planning to go to Oahu, Hawaii for her vacation, so I invited myself :P. Excellent food, hiking, snorkeling, shave ice, culture and beautiful views every day <3",
    "title": "Oahu, Hawaii"
  },
  "2023-10-06": {
    "date": "2023-10-06",
    "summary": "We went to Mr. Bones Pumpkin Patch and got Versailles Cuban Food. Then I got Covid the next day and nurse Mari took care of me the whole weekend <3.",
    "title": "Nurse Mari saves Tim"
  },
  "2023-10-20": {
    "date": "2023-10-20",
    "summary": "Weekend getaway to Yosemite National Park. Tunnel Viewpoint, Vernal Falls via Mist trail, Bridalveil Falls Viewpoint, Valley Viewpoint, Mariposa Grove, Washburn Trail, Fallen Monarch, Bachelor and Three Graces, Grizzly Giant, California Tunnel Tree, Faithful Couple, Clothespin Tree",
    "title": "Yosemite & Mariposa Grove of giant Sequoias"
  },
  "2023-10-21": {
    "date": "2023-10-21",
    "summary": "Weekend getaway to Sequoia National Park. Congress Trail, General Sherman Tree, Tough Twins, McKinley Tree, Big rees Trail, Moro Rock, Beetle Rock, Drive to Fresno, Indian Kebab Palace",
    "title": "Sequoia National Park"
  },
  "2023-11-18": {
    "date": "2023-11-18",
    "summary": "Happy late birthday dinner, courtesy of the bae.",
    "title": "71 Above"
  },
  "2023-12-16": {
    "date": "2023-12-16",
    "summary": "Mari and I attended her first wedding in the United States. Congratulations to ShaWeley! I would add more photos, but someone is taking their sweet time to release their wedding photos...",
    "title": "Shannon's Wedding"
  },
  "2023-12-29": {
    "date": "2023-12-29",
    "summary": "I finally met some of Mari's friends from Japan! Mari and I got to show Haruka and Makoto around SoCal. We went to Salvation Mountain and Joshua Tree.",
    "title": "Haruka/Makoto part 1"
  },
  "2023-12-31": {
    "date": "2023-12-31",
    "summary": "Disneyland for New Years countdown with Haruka and Makoto. Congratulations to Haruka and Makoto on the Disneyland marriage proposal!",
    "title": "Haruka/Makoto part 2"
  },
  "2024-01-11": {
    "date": "2024-01-11",
    "summary": "Jan 11 to Jan 19. Mari showed me around the her hood and I got to meet her brother Masato! We went to Hiroshima, Oita, Fukuoka, Osaka, Kyoto and Tokyo!",
    "title": "Japan"
  },
  "2024-02-10": {
    "date": "2024-02-10",
    "summary": "We hiked to First Water and saw a bear :O. Mari says I shouldn't shout out 'OH SHIT' when I see a bear... Then we drank in Ktown to celebrate Curtis's bday with my cousin Kevin and some college friends!",
    "title": "First Water Bear and KTown Birthday"
  },
  "2024-02-24": {
    "date": "2024-02-24",
    "summary": "To start we got Cream Pan and Omomo (One of Mari's fav boba stores). Then we celebrated my friend Conrad's bday with flag football and pickleball. Mari got to meet my fake frat TSA while eating at the INI ristorante.",
    "title": "Cream Pan, Conrad's bday, and TSA at INI"
  },
  "2024-03-16": {
    "date": "2024-03-16",
    "summary": "Santa Barbara with our fav double date couple ShaWeley, even though they sometimes betray us by double dating with my ex >:(",
    "title": "Santa Barbara with ShaWeley"
  },
  "2024-03-02": {
    "date": "2024-03-02",
    "summary": "Taiwanese breakfast, Little Tokyo, Matcha Ice Cream, Japanese American Museum, Sushi Gen, games, waffles, and ice cream with ShaWeley, MeloTim, and Anda. ",
    "title": "Mari like my fam and friends :)"
  },
  "2024-03-23": {
    "date": "2024-03-23",
    "summary": "Weekend getaway to Monterey and Pinnacles National Park.",
    "title": "Monterey&Pinnacles"
  },
  "2024-04-06": {
    "date": "2024-04-06",
    "summary": "We LOVE day tripping to San Diego! Today a random photographer asked to take our photos.",
    "title": "San Diego"
  },
  "2024-04-13": {
    "date": "2024-04-13",
    "summary": "Happy Birthday to Kotona! We got to hang out with Au pairs Juno and Kotona, so we showed them around Grand Central Market, The Broad, and Little Tokyo.",
    "title": "Juno and Kotona"
  },
  "2024-04-22": {
    "date": "2024-04-22",
    "summary": "We've done Universals Studios Japan and now we're hitting up Universals Studios Hollywood! Mari's gracious host family invited us out!",
    "title": "Universals Studios Hollywood"
  },
  "2024-04-27": {
    "date": "2024-04-27",
    "summary": "Malibu Seafood, Escondido Falls Trail, Point Dum Cove Trail, Saddle Peak trail, and Anarbagh!",
    "title": "Malibu!"
  },
  "2024-05-05": {
    "date": "2024-05-05",
    "summary": "Goodbye party for au pair Minami. It was fun practicing Japanese with a ton of au pairs.",
    "title": "Bye Bye Minami"
  },
  "2024-05-11": {
    "date": "2024-05-11",
    "summary": "Mari attends her first US graduation! My sister is now Dr. Jan from the USC School of Pharmacy!",
    "title": "The New Dr. Jan"
  },
  "2024-06-02": {
    "date": "2024-06-02",
    "summary": "Aaron and Josh are back in town so we did a Hollywood day! Wat Thai street food market, WeHo Pride Street Fair, and Melrose blvd shopping. Then ShaWeley joined us for For the Win smashburgers, Mari's first escape room in the US, and 626 Ice Cream!",
    "title": "Weho Pride, Melrose blvd, For the Win, Escape Room, and 626 Ice Cream"
  },
  "2024-06-08": {
    "date": "2024-06-08",
    "summary": "Corlieu Falls and Red Rock Falls via Lewis Creek National Scenic Trail, Sentinel Meadow Cook’s Meadow Loop Trail, Vernal Falls Trail, Mirror Lake via Valley Loop Trail, Pizza Deck, and Cedar Lodge.",
    "title": "Yosemite in the Summer part 1"
  },
  "2024-06-09": {
    "date": "2024-06-09",
    "summary": "Glacier Point, Washburn Point, Sentinel Dome and Taft Point Loop, Smokehouse 41, and Indian Kebab Palace.",
    "title": "Yosemite in the Summer part 2"
  },
  "2024-06-17": {
    "date": "2024-06-17",
    "summary": "We spent our 1 year Anniversary at Santa Catalina Island! We took a ferry, hiked Hermit Gulch Trail, and visited the Wrigley Memorial & Botanical Garden between 5am and 11am. Next we ate seafood at NDMK Fish House and had ice cream at Sailor’s Delight. We browsed the Catalina shops and visited the Catalina Casino before going on an awesome Bison Expedition Tour where we saw a bunch of animals including Bison :D. We finished with some delightful seafood at Lobster Trap!",
    "title": "Happy 1 Year Anniversary at Catalina!"
  },
  "2024-06-22": {
    "date": "2024-06-22",
    "summary": "We are officially engaged! Engagement ring shopping and a simple beach proposal.",
    "title": "She said Yes!"
  },
  "2024-07-20": {
    "date": "2024-07-20",
    "summary": "Dim sum triple date, Americana/Glendale Galleria, board games, and Mills Alley with cousin Mel and Tim",
    "title": "Nom"
  },
  "2024-07-21": {
    "date": "2024-07-21",
    "summary": "Mae Malai Thai House of Noodles, Kanomwaan Thai Gelato and Dessert Cafe, our first Dodger's game and board games.",
    "title": "Go Dodgers!"
  },
  "2024-07-22": {
    "date": "2024-07-22",
    "summary": "Got our Marriage License, Cafe on 27, Westfield Centruy City, Two Rodeo, and Lawry's House of Prime Rib.",
    "title": "Marriage License and Engagement dinner!"
  },
  "2024-08-03": {
    "date": "2024-08-03",
    "summary": "After lunch, a little wedding meeting, and games with Shannon/Weley, Mari got some quality time with Tim's parents at Summit House.",
    "title": "Summit house with parents"
  }
}
