{
  "2023-05-06": {
    "date": "2023-05-06",
    "summary": "Our first date was around 12 hours long. After we were official she said I talked too much this first date especially since she had use her brain to translate everything to Japanese... We went to the Broad, shared Mexican and Filipino food at Grand Central Market, walked around the outdoor mall and beach near Santa Monica Pier, and finished with some pho!",
    "title": "First Date"
  },
  "2023-05-14": {
    "date": "2023-05-14",
    "summary": "Mari's favorite food is shaved ice, especially Japanese style shaved ice called 'kakigori'! We went to the Hollywood Farmer's Market to eat, and then Smorgasburg to eat more and then Oakobing to eat some more.",
    "title": "More Food"
  },
  "2023-06-17": {
    "date": "2023-06-17",
    "summary": "I asked Mari to be my girlfriend and she said yes! We did the Eaton Canyon hike, AYCE sushi at Aikan Sushi and Ramen, and did 36 questions to fall in love.",
    "title": "Official"
  },
  "2023-06-24": {
    "date": "2023-06-24",
    "summary": "We got ate Menya Ultra, ate Koli bar, hiked Torrey Pines State Park, walked around La Jolla, saw her first wedding in the US, ate at Phil's BBQ(her favorite restaurant in the US), and ate more at Mngo Cafe.",
    "title": "1st Time San Diego"
  },
  "2023-07-07": {
    "date": "2023-07-07",
    "summary": "First double date with my buddy Josh and his future wifee Emily!",
    "title": "First Double Date"
  },
  "2023-08-04": {
    "date": "2023-08-04",
    "summary": "Excellent food, hiking, snorkeling, shave ice, new culture and beautiful views every day. ",
    "title": "Oahu, Hawaii"
  },
  "2023-10-20": {
    "date": "2023-10-20",
    "summary": "Weekend getaway to Yosemite and Sequoia National Park.",
    "title": "Yosemite&Sequoia"
  },
  "2023-12-16": {
    "date": "2023-12-16",
    "summary": "Mari and I attended her first wedding in the United States. Congratulations to ShaWeley!",
    "title": "Shannon's Wedding"
  },
  "2023-12-31": {
    "date": "2023-12-31",
    "summary": "I finally met some of Mari's friends from Japan! Mari and I got to show Haruka and Makoto around SoCal. We went to Salvation Mountain, Joshua Tree, Disneyland for New Years countdown, Hollywood sign, Santa Monica and LACMA. Congratulations to Haruka and Makoto on the Disneyland marriage proposal!",
    "title": "Haruka/Makoto"
  },
  "2024-01-11": {
    "date": "2024-01-11",
    "summary": "Mari took me around the her hood and I got to meet her brother Masado! We went to Hiroshima, Oita, Fukuoka, Osaka, Kyoto and Tokyo!",
    "title": "Japan"
  },
  "2024-03-16": {
    "date": "2024-03-16",
    "summary": "Santa Barbara with our fav double date couple ShaWeley!",
    "title": "SB with ShaWeley"
  },
  "2024-03-23": {
    "date": "2024-03-23",
    "summary": "Weekend getaway to Monterey and Pinnacles National Park.",
    "title": "Monterey&Pinnacles"
  },
  "2024-04-06": {
    "date": "2024-04-06",
    "summary": "We LOVE day tripping to San Diego! Today a random photographer asked to take our photos.",
    "title": "San Diego"
  },
  "2024-04-13": {
    "date": "2024-04-13",
    "summary": "Happy Birthday to Kotona! We got to hang out with a few more Au pairs, so we showed them around Grand Central Market, The Broad, and Little Tokyo.",
    "title": "Juno and Kotona"
  },
  "2024-04-22": {
    "date": "2024-04-22",
    "summary": "We've done Universals Studios Japan and now we're hitting up USH! Mari's gracious host family invited us out!",
    "title": "Universals Studios Hollywood"
  },
  "2024-04-27": {
    "date": "2024-04-27",
    "summary": "Malibu Seafood, Escondido Falls Trail, Point Dum Cove Trail, and Saddle Peak trail!",
    "title": "Malibu!"
  },
  "2024-05-05": {
    "date": "2024-05-05",
    "summary": "Goodbye party to au pair Minami. It was fun practicing Japanese with a ton of au pairs",
    "title": "Bye Bye Minami"
  },
  "2024-05-11": {
    "date": "2024-05-11",
    "summary": "Mari attends her first US gradaution! My sister is now Dr. Jan from the USC School of Pharmacy!",
    "title": "The New Dr. Jan"
  }
}
